[
    {
        "text": "Khomo tsa tala li lahla balisa",
        "meaning": "Ha motho a fumane monono, a ka qetella a se a sa tsotelle le ba mothusitseng ho fihla moo.",
        "translation": "Sometimes when a person is experiencing a joyous life or moment, they turn to forget those who helped them reach that state.",
        "category": "Khomo"
    },
    {
        "text": "Khomo boela haeno u holile",
        "meaning": "Ke maele a sebelisoang ha motho a bile sebakeng se eseng habo, joale ha lilemo li mo lumella o lokela ho khutlela habo.",
        "translation": "One has to return to their place of origin when sufficiently grown or when their purpose in the current place is over.",
        "category": "Khomo"
    },
    {
        "text": "Khomo ke molimo o nko e metsi",
        "meaning": "Melemo ea khomo bophelong ba Basotho ha e na ho lekanyoa.",
        "translation": "Cattle are regarded as the most significant animals among Basotho due to their cultural and practical roles, thus compared to God’s importance.",
        "category": "Khomo"
    },
    {
        "text": "Ke khomo ea senona le tlhako",
        "meaning": "Ke ha motho a na le maruo kapa a fana ka nkatana.",
        "translation": "It refers to a wealthy or rich person.",
        "category": "Khomo"
    },
    {
        "text": "Likhomo ke lisala li eme",
        "meaning": "Ha motho a e-na le maruo, o lula a bonahala ka tsona.",
        "translation": "Wealth (like cattle) always stands out and is visible.",
        "category": "Khomo"
    },
    {
        "text": "O jele khomo ea molatelle",
        "meaning": "Ke ha motho a latella ntho esita leha ho se sa hlokahala.",
        "translation": "When someone persists in following something even when it’s no longer necessary.",
        "category": "Khomo"
    },
    {
        "text": "Ntoa ke khomo’a khameloa-meutloeng",
        "meaning": "Ho tsoela pele le ha motho a le maemong a boima haholo bophelong.",
        "translation": "When a person is experiencing the greatest difficulties in life but still continues the journey.",
        "category": "Khomo"
    },
    {
        "text": "Khomo ha li na motloapele",
        "meaning": "Katleho ea motho e tla fihla ka nako ea hae.",
        "translation": "Everyone’s success will come at its appointed time.",
        "category": "Khomo"
    },
    {
        "text": "Li jana maro ntja tsa setsumi",
        "meaning": "Ke ha bana ba motho ba loant’sana.",
        "translation": "It is when children of the same father fight among themselves.",
        "category": "Ntja"
    },
    {
        "text": "Ha u otla ntja e tla u betlela meno",
        "meaning": "Ha u sotla motho kapa phoofolo, o ka qetella a boela ho u hlasela.",
        "translation": "If you constantly mistreat a person or animal, they might retaliate one day.",
        "category": "Ntja"
    },
    {
        "text": "Ke ntja seloma mokhoki",
        "meaning": "Ho thusa motho ebe ha a qeta ho u fetohela.",
        "translation": "Helping someone only for them to turn against you.",
        "category": "Ntja"
    },
    {
        "text": "Ke ntja ea se t’soarisa mohlophe",
        "meaning": "Ke ha motho a bonahala eka o molemo empa a le kotsi.",
        "translation": "A person who appears harmless but is actually dangerous.",
        "category": "Ntja"
    },
    {
        "text": "Tau tsa hlaka le le leng lia tsebana",
        "meaning": "Ba matla kapa ba tšoanang ba a tsebana.",
        "translation": "Strong or similar people recognize each other.",
        "category": "Tau"
    },
    {
        "text": "Basali ke tau li mesana",
        "meaning": "Basali ba ka tsoha ba ba le matla kapa sebete se seholo.",
        "translation": "Women can show great strength or bravery.",
        "category": "Tau"
    },
    {
        "text": "Tau ha li hlatsoane maro",
        "meaning": "Batho ba matla ha ba tsoare lipuisano tse senyang.",
        "translation": "Strong people don’t waste time in petty quarrels.",
        "category": "Tau"
    },
    {
        "text": "Phokojoe ea mofutsana e fetoha tlakaro",
        "meaning": "Ha motho a futsanehile, o tšoaroa joalo ka papali ke ba bang.",
        "translation": "When a person is poor, others treat them like a toy.",
        "category": "Phokojoe"
    },
    {
        "text": "Phokojoe ea t’salla morao e bonoa ke lintja",
        "meaning": "Ha motho a sa potlake, ba bang ba tla mo hlōla kapa ba mo utloe.",
        "translation": "If one lags behind, others will catch up and expose them.",
        "category": "Phokojoe"
    },
    {
        "text": "Phokojoe ho phela e liretsana",
        "meaning": "Bophelo ba futsanehi bo tšoana le ho phela ka ho tšehetsoa ke ba bang.",
        "translation": "The life of a poor person depends on others’ leftovers.",
        "category": "Phokojoe"
    },
    {
        "text": "Phokojoe e lahliloe ke mongobo",
        "meaning": "Ha motho a lahletsoe ke lintho tsa bohlokoa, a sala a se na thuso.",
        "translation": "When someone loses essential support, they become helpless.",
        "category": "Phokojoe"
    },
    {
        "text": "Khomo tsa tala li lahla balisa",
        "meaning": "Kamehla ha monono u le teng motho ha tsotelle ba mo alositseng",
        "translation": "When there's wealth, one sometimes turns to turn a blind eye to the ones who actually uplifted them to such greatest height. ",
        "category": "Khomo"
    }
]